app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games"

  def create
    @game = Game.new(game_params)

    # TODO: pick a rival for player who requests a new game
    @game.player1_id = 1
    @game.player2_id = 2

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "num_of_words", "player1_id", "player2_id", "stock_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 07 Aug 2015 22:02:49 UTC +00:00], ["num_of_words", 5], ["player1_id", 1], ["player2_id", 2], ["stock_id", 1], ["updated_at", Fri, 07 Aug 2015 22:02:49 UTC +00:00]]

    def set_game
      @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]